{
  "DOCKGUY1": "\"Oh me? I'm just enjoying this wonderful peepeepoopoo\" -",
  "DOCKGUY2": "\"Some people say if you follow the old dock heading west, theres a fortress at the end!\" -",
  "DOCKGUY3": "\"If you need a way to cross water, go to the fisherman's shack on the water\" -",

  "FISHERMAN1": "\"Aye lad, what can i do for thee?\" -",
  "FISHERMAN2": "\"If ye need a boat, you can buy me old one sitting over there\" -",
  "FISHERMAN3": "\"Ye know, there used to be a old man 'round here, sailed off one day and I aven't seen him since\" -",

  "GAMBLER1": "\"Hello there old boy! Here to try your luck?\" -",
  "GAMBLER2": "\"Buy a bag and you may get your coins back and then some!\" -",
  "GAMBLER3": "\"Gem? of course! you can afford as many gems as you want, just play my game!\" -",

  "GRASSGUY1": "\"Oh me? just enjoying this stinky grass!\" -",
  "GRASSGUY2": "\"Theres a fortress north of here, they say you need to sail up the river to get inside\" -",
  "GRASSGUY3": "\"Gem? oh, talk to the Mayor he can help\" -",

  "JOURNAL1": "\"Day XXX: Ever since I heard the legend of the old hero, I've been training for a great quest!\" -",
  "JOURNAL2": "\"Day XZX: Finally a lead to begin my quest! but to pursue it I need an gem...\" -",
  "JOURNAL3": "\"Day 69: Given the research I've done, there should be someone in this town who has one, time to ask around\" -",

  "MAYOR1": "\"A gem you say? yes I have it but I need a favor\" -",
  "MAYOR2": "\"Kill all the elites in the area and I'll sell you one\" -",
  "MAYOR3": "\"Need help? talk to the Guys, they'll point you in the right direction\" -",
  "MAYOR4": "\"Come back when your not dumb, I'll have the gem ready\" -",

  "OLDHERMIT1": "\"Hehehehehe ooooo look at you hehehe (eyes you up)\" -",
  "OLDHERMIT2": "\"Need some fire power? hehe I've got just the thing hehe\" -",
  "OLDHERMIT3": "\"If you buy it you'll never have to fight again hehe\" -",

  "QUESTDEALER1": "\"Oh! Hi! Didn't see you there, feel free to take a quest!\" -",
  "QUESTDEALER2": "(\"What? a gem you say? I heard the Mayor might have one\\\" -\"",

  "RETIREDSOLDIER1": "\"Huh, didn't expect anyone coming around here\" -",
  "RETIREDSOLDIER2": "\"I'll sell you my old weapons if you want, but don't expect me to help you fight\" -",
  "RETIREDSOLDIER3": "\"Be careful theres a cave north of here full of monsters\" -",

  "SANDGUY1": "\"Oh me? just enjoying this amazing sand!\" -",
  "SANDGUY2": "\"If you head west along the cost you'll find a retired soldier, he's a pretty cool dude!\" -",
  "SANDGUY3": "\"If you want to sign up to some quests before you go, just enter the building east of here!\" -",

  "SHOPKEEP1": "\"Hello! Welcome to my stinky shop!\" -",
  "SHOPKEEP2": "\"If you want to try your luck, talk to my friend the room over\" -",
  "SHOPKEEP3": "\"Gem? no I don't have anything like that\" -",

  "SIGN1": "\"Health Shop! (Shady!)\" -",

  "GIVE_HEALTH_QUEST": "\"Could I get some blood? maybe 3 HP worth?\" -Legitamite Docter",
  "GIVE_SPEAR_QUEST": "\"My spear was damaged cuz im fat, and I need a new one\" -Fat Hunter",
  "GIVE_HULA_QUEST": "\"gib hula-hoop, some0ne get\" -Liitle Giy"
}